/*
 * Common (OS-independent) portion of Broadcom 802.11 Networking Device Driver
 * TX and RX status offload module
 *
 * Copyright 2020 Broadcom
 *
 * This program is the proprietary software of Broadcom and/or
 * its licensors, and may only be used, duplicated, modified or distributed
 * pursuant to the terms and conditions of a separate, written license
 * agreement executed between you and Broadcom (an "Authorized License").
 * Except as set forth in an Authorized License, Broadcom grants no license
 * (express or implied), right to use, or waiver of any kind with respect to
 * the Software, and Broadcom expressly reserves all rights in and to the
 * Software and all intellectual property rights therein.  IF YOU HAVE NO
 * AUTHORIZED LICENSE, THEN YOU HAVE NO RIGHT TO USE THIS SOFTWARE IN ANY
 * WAY, AND SHOULD IMMEDIATELY NOTIFY BROADCOM AND DISCONTINUE ALL USE OF
 * THE SOFTWARE.
 *
 * Except as expressly set forth in the Authorized License,
 *
 * 1. This program, including its structure, sequence and organization,
 * constitutes the valuable trade secrets of Broadcom, and you shall use
 * all reasonable efforts to protect the confidentiality thereof, and to
 * use this information only in connection with your use of Broadcom
 * integrated circuit products.
 *
 * 2. TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED
 * "AS IS" AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES,
 * REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR

#endif /* WLC_OFFLOADS_M2M_INTR */

/* M2M corerev check */
#define STATUS_OFFLOAD_SUPPORTED(rev)		(((rev) == 128) || /* 63178, 47622, 6750 */ \
						 ((rev) == 129) || /* 6710 */ \
						 ((rev) == 131) ||  /* 6715 */ \
						 ((rev) == 132))    /* 6756 */

#define	PCI64ADDR_HIGH				0x80000000	/* address[63] */

#define DMA_OFFSET_BME_BASE_CHANNEL3_XMT	0x2C0
#define DMA_OFFSET_BME_BASE_CHANNEL3_RCV	0x2E0

#define M2M_OFFSET_BME_TXSTS_REGS		0x800
#define M2M_OFFSET_BME_PHYRXSTS_REGS		0x900

/**
 * The BME has the same registers as a DMA engine (using the same address space). So the
 * struct dma64regs_t from sbhnddma.h is reused. The bits of some of the fields are
 * defined here.
 */
#define BMEREG_CONTROL_EN			(1 << 0)
#define BMEREG_CONTROL_BURSTLEN_SHIFT		18
#define BMEREG_CONTROL_BURSTLEN_MASK		0x7

#define BMEREG_RCVCONTROL_WCPD_SHIFT		(1 << 28)

/* For txstatus memory/phyrxtatus memory inside the d11 core for d11 corerev >= 130,
 * where the d11 memory address offset for tx/phyrx status is defined in the below.
 * Need to add backplane address with this offset for the absolute physical address,
 * from the BME's perspective.
 */
#define D11_TXSTS_MEM_OFFSET			0x008d8000
#define D11_TXSTS_MEM_OFFSET_REV132		0x008f0000
#define D11_PHYRXSTS_MEM_OFFSET			0x008d9000
#define D11_PHYRXSTS_MEM_OFFSET_REV132		0x008f1000

#if defined(__ARM_ARCH_7A__)
#define datasynchronizationbarrier() __asm__ __volatile__ ("dsb")
#endif /* __ARM_ARCH_7A__ */

#if defined(WLC_OFFLOADS_M2M_INTR)

#define OFFLD_SWITCHCORE(_sih_, _origidx_, _intr_val_)				\
({										\
	BCM_REFERENCE(_origidx_);						\
	BCM_REFERENCE(_intr_val_);						\
})

#define OFFLD_RESTORECORE(_sih_, _coreid_, _intr_val_)

#else /* ! WLC_OFFLOADS_M2M_INTR */

#define OFFLD_SWITCHCORE(_sih_, _origidx_, _intr_val_)				\
({										\
	*_origidx_ = 0;								\
	*_intr_val_ = 0;							\
	 if (BUSTYPE(_sih_->bustype) == PCI_BUS) {				\
		si_switch_core(_sih_, M2MDMA_CORE_ID, _origidx_, _intr_val_);	\
	}									\
})

#define OFFLD_RESTORECORE(_sih_, _coreid_, _intr_val_)		\
	if (BUSTYPE(_sih_->bustype) == PCI_BUS)			\
		si_restore_core(_sih_, _coreid_, _intr_val_);

#endif /* ! WLC_OFFLOADS_M2M_INTR */

#define OFFLD_CIRC_BUF_NEXT_IDX(idx, pc)		MODINC_POW2((idx), pc->n_elements)
#define OFFLD_CIRC_BUF_INUSE(bitmap, idx)		isset((bitmap), (idx))
#define OFFLD_CIRC_BUF_SET_INUSE(bitmap, idx)	setbit((bitmap), (idx))
#define OFFLD_CIRC_BUF_CLR_INUSE(bitmap, idx)	clrbit((bitmap), (idx))

#define CBUF_N_TXSTS_PACKAGE_ENTRIES	1024 /**< 1024 elements in BME ring buffer */

#define D11_HWA_MACIF_CTL_RXPHYSTS_MAC_HWA_IF_EN (1 << 8)
#define D11_HWA_MACIF_CTL_RXPHYSTS_METHOD (1 << 10) /** 1 = through RXE_PHYSTS_DATAL/H */
#define D11_HWA_MACIF_CTL_RXPHYSTS_COUNT (1 << 12)

#define D11_HWA_MACIF_CTL_VAL (D11_HWA_MACIF_CTL_RXPHYSTS_MAC_HWA_IF_EN | \
			       D11_HWA_MACIF_CTL_RXPHYSTS_METHOD | \
			       D11_HWA_MACIF_CTL_RXPHYSTS_COUNT)

/** SB side: BME registers for phyrxsts / txstatus acceleration */
typedef struct m2m_bme_status_regs {
	uint32 cfg;		/* 0x0 */
	uint32 ctl;	/* 0x4 */
	uint32 sts;	/* 0x8 */
	uint32 debug;	/*  0xC */
	uint32 da_base_l;	/* 0x10 */
	uint32 da_base_h;	/* 0x14 */
	uint32 size;	/* 0x18 */
	uint32 wr_idx;	/* 0x1C */
	uint32 rd_idx;	/* 0x20 */
	uint32 dma_template;	/* 0x24 */
	uint32 sa_base_l;	/* 0x28 */
	uint32 sa_base_h;	/* 0x2C */
} m2m_bme_status_regs_t;

/** bits in m2m_bme_status_regs_t::cfg register */
#define BME_STS_CFG_MOD_ENBL_NBITS 1
#define BME_STS_CFG_MOD_ENBL_SHIFT 0
#define BME_STS_CFG_MOD_ENBL_MASK BCM_MASK(BME_STS_CFG_MOD_ENBL)
#define BME_STS_CFG_MOD_CH_NBITS 3
#define BME_STS_CFG_MOD_CH_SHIFT 3
#define BME_STS_CFG_MOD_CH_MASK BCM_MASK(BME_STS_CFG_MOD_CH)
#define BME_STS_CFG_EXTRARD_NBITS 1
#define BME_STS_CFG_EXTRARD_SHIFT 4
#define BME_STS_CFG_EXTRARD_MASK BCM_MASK(BME_STS_CFG_EXTRARD)
#define BME_STS_CFG_STOPCOND_NBITS 2
#define BME_STS_CFG_STOPCOND_SHIFT 2
#define BME_STS_CFG_STOPCOND_MASK  BCM_MASK(BME_STS_CFG_STOPCOND)

/** bits in m2m_bme_status_regs_t::dma_template register */
#define BME_DMATMPL_NOTPCIEDP_SHIFT   0 /**< NotPcie filled in DMA descr used for destination */
#define BME_DMATMPL_NOTPCIEDP_NBITS   1
#define BME_DMATMPL_NOTPCIEDP_MASK     BCM_MASK(BME_DMATMPL_NOTPCIEDP)

